app/views/genres/index.html.erb

SELECT "genres".* FROM "genres"
SELECT COUNT(*) FROM "genres"
---
<ol>
  <%=pluralize(@genres.count,'genre')%>