app/views/movies/show.html.erb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---

  <% if @movie.recent_reviews.any?%>