app/views/users/index.html.erb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
<header id="content-header">
  <h1><%=pluralize(@users.size,'User')%></h1>