app/controllers/favorites_controller.rb

	def create

		#find movie
		#add favorite by the user
		@fav_movie=@movie.favorites.create(user:current_user)
---
INSERT INTO "favorites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 24 Dec 2014 08:55:20 UTC +00:00], ["movie_id", 1], ["updated_at", Wed, 24 Dec 2014 08:55:20 UTC +00:00], ["user_id", 2]]

	def destroy
		favorite=current_user.favorites.find(params[:id])
		favorite.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 2], ["id", "51"]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 51]]