app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
		@genre=Genre.find(params[:id])

INSERT INTO "genres" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 28 Dec 2014 15:04:00 UTC +00:00], ["name", "Action"], ["updated_at", Sun, 28 Dec 2014 15:04:00 UTC +00:00]]
---
	def create
		@genre=Genre.new(genre_params)
		if @genre.save

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = 1  [["name", "Action2"], ["updated_at", Sun, 28 Dec 2014 11:59:18 UTC +00:00]]
---
	def update
		@genre=Genre.find(params[:id])
		if @genre.update(genre_params)

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 1]]
---
	def destroy
		@genre=Genre.find(params[:id])
		@genre.destroy