app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = 1 LIMIT 1  [["user_id", 2]]
SELECT "genres".* FROM "genres" INNER JOIN "characterizations" ON "genres"."id" = "characterizations"."genre_id" WHERE "characterizations"."movie_id" = ?  [["movie_id", 1]]
---
  def show
    @movie = Movie.find(params[:id])
    @fans=@movie.fans
    @genres=@movie.genres

    if current_user
      @current_favorite=current_user.favorites.find_by(movie_id:@movie.id)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["title", "Iron Lady"], ["updated_at", Fri, 12 Dec 2014 13:13:44 UTC +00:00]]
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)