app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "It was ok "], ["created_at", Sun, 14 Dec 2014 10:39:49 UTC +00:00], ["movie_id", 1], ["name", "Manolis Papidakis"], ["stars", 2], ["updated_at", Sun, 14 Dec 2014 10:39:49 UTC +00:00]]
---
	def create
		@review=@movie.reviews.new(review_params)
		@review.user=current_user
		if @review.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", :review_id]]
---
	def show
		@review=@movie.reviews.find(params[:id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", "9"]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 9]]
---
	def destroy
		@review=@movie.reviews.find(params[:id])
		@review.destroy