app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@user=User.new(user_params)

		if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["password_digest", "$2a$10$XDQ3D21iSGASE4dRttZNiOydnxbNIPaAVUwr4Rn1WEpvskrN4pbUa"], ["updated_at", Tue, 16 Dec 2014 11:13:41 UTC +00:00]]
---
	def update
		@user=User.find(params[:id])
		if @user.update(user_params)